[ {
  "name": "Rob Van Dam",
  "deckSize": 16,
  "startingHealth": 15,
  "lowHealth": 4,
  "startingStamina": 16,
  "lowStamina": 2,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "There are many ways to describe Rob Van Dam. He is a multi-time World Champion, a freak athlete, and one of the most popular stars to ever grace this great sport. But all these descriptions pale in comparison to what he is known for best; a trailblazer, a show stealer, and undoubtedly the Whole Damn Show.\n\nDespite weighing 235 Pounds, he has the agility of a Gazelle, the speed of a Cobra, and the lethal kicks of an action movie star. He will wow anyone with his moves, and a few minutes into any match, he will have the entire stadium stand on their feet, pointing towards themselves with their thumbs while shouting “Rob… Van… Dam”. He can also be brutal, using a combination of chairs and kicks in dazzling ways that would knock his opponents out cold.\n\nNow, brought to the future to compete for the crown of the All Time Hardcore Champion, RVD has the opportunity to captivate a new audience. And while doing so, he not only plans to win the Hardcore Title, but the All Time Wrestling Championship.",
  "gender": "MALE"
}, {
  "name": "Rey Jaguar",
  "deckSize": 15,
  "startingHealth": 13,
  "lowHealth": 2,
  "startingStamina": 17,
  "lowStamina": 2,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Of all the men who have ever stepped into a wrestling ring, none are more fearless than “El Intrépido” Rey Jaguar. He has the heart of 20 men, the finesse of a soaring eagle, and the ferociousness of an alpha predator. Yet this fearlessness was forged by a great tragedy.\n\nWhen Rey was a little boy, he and his family went on a vacation. As the plane took off, calamity struck. To the shock of all, he emerged with barely a scratch on his body! The media called him the invincible kid, and he grew up believing he was just that.\n\nAs a big Lucha Libre fan, Rey would test his belief of invincibility by jumping off roofs, crashing into walls, opponents, and sometimes pavements. Yet he always emerged stronger. These experiences convinced him that he had nothing to fear in this life, for God had bigger plans for him.\n\nAt an early age, he planned to surpass the great “El Santo” as the best Lucha wrestler to have ever lived. Many believe he achieved that when in 2034 AD, he captured and unified all the 3 Mexican world championships and held them for a historic 4 years. He was the Jaguar; the king of all.\n\nRey’s success was due to his lightning speed, his ability to take an immense amount of punishment, and his willingness to sacrifice his own body to land a devastating blow to his opponent.\n\nNow awoken half a century after his retirement, Rey is ready to fly, risking his body, heart and soul to win the ultimate prize; The All Time Championship. The question isn't who can stop him. The question is, can anyone keep the Jaguar down? Fear the fearless Jaguar… for he is coming.",
  "gender": "MALE"
}, {
  "name": "Kurt Angle",
  "deckSize": 15,
  "startingHealth": 16,
  "lowHealth": 4,
  "startingStamina": 16,
  "lowStamina": 2,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Hailing from Pittsburgh, Pennsylvania, Kurt Angle is arguably the most decorated wrestler to ever step into a squared circle. He is a 13-time World Champion, a wrestling machine, and a man who won an Olympic Gold Medal with a broken neck. But perhaps his most incredible legacy is how well he excelled at everything he did.\n\nKurt can outwrestle anyone. Outperform anyone. Endure more than anyone. He can fly off cages, knock out his opponents, and counter any move into an Ankle Lock, making all of his opponents tap. His conditioning and intensity cannot be matched. He delivers an array of strikes, suplexes, and submissions that guarantee his victory.\n\nHe is simply the best of his generation. Perhaps he is the best ever. Yet, the legacy of Kurt Angle as the G.O.A.T is questioned by some. Maybe it’s the injuries or the career choices, but some still claim 200 years later that he never reached his full potential. A scary thought, given how great he was. But Kurt, in his typical fashion, relishes the challenge.\n\nFinally, with the best wrestlers of all time gathered in one place, at one time, and in one promotion, this is his chance to put his legacy to the test. He will fight, he will break ankles, and he will make sure each one of them taps to his will. Oh, it’s real. It’s damn real!",
  "gender": "MALE"
}, {
  "name": "Oda Tsurugi",
  "deckSize": 15,
  "startingHealth": 16,
  "lowHealth": 4,
  "startingStamina": 16,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "From criminal to hero to villain to he-who-must not be named, Oda Tsuguri is one of the most controversial wrestlers to have ever lived. Born in 2361 AD in Osaka Japan as a member of the legendary Oda clan, he grew up as a street criminal before joining the Yakuza, rising rapidly through their ranks. By the age of 24, he was already anointed as their next leader.\n\nBut something strange happened a year later. Oda came across a burning building and rushed into danger, saving 18 souls. Amid the fire, he saw a vision of his ancestors and vowed he would bring honor to them. Leaving his criminal life behind, he began training in jujitsu, earning a black belt and winning several world titles. He then set his sights on pro-wrestling and became fixated with creating a legacy that would crown him as the best ever. Fans quickly took to him, inspired by his redemption story. But despite his enormous popularity and incredible success as a 7-time world champion, Oda was not able to establish his legacy as the best wrestler of his generation, let alone the best wrestler of all time. For he was unlucky enough to wrestle during the reign of the “Great Okada”. For years he worked day and night to outperform his rival, but he was never able to transcend his shadow.\n\nYears of frustration pushed him to the edge. One night, he snapped, piledriving Okada on a concrete slab and retiring him forever, and thus becoming the most hated man in wrestling. But it was a little too late for Oda; he just turned 44 and his prime years were behind him. He was slowly overshadowed by a new generation of young and hungry wrestlers. Determined to fulfill his destiny as the all-time best, he sought to reverse his aging and found a mad scientist who promised to make him whole once more. The scientist used banned technology that turned Oda into a genetically modified cyborg with immense strength, speed and resilience.\n\nNow fully enhanced, he spent a year on a rampage, destroying every champion in every federation and retiring them for good. As wrestlers refused to face him and quit in droves, the federations decided to ban him from ever competing in wrestling ring, citing he was no longer human. Oda then disappeared without a trace. Some say he is vying for his time, waiting to strike again… waiting to cement his legacy as the All Time Champion.",
  "gender": "MALE"
}, {
  "name": "André the Giant",
  "deckSize": 15,
  "startingHealth": 20,
  "lowHealth": 3,
  "startingStamina": 11,
  "lowStamina": 2,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "There is no one and nothing bigger than the “8th Wonder of the World”, Andre the Giant. Standing at 7 feet 4 inches, and weighing in at 500 pounds, Andre was massive. No other man or wrestler could stand toe to toe with Andre, and none could beat him during his prime, where he didn't suffer a single pinfall loss for over 15 years. But it wasn't just his humongous size that made him stand out, it was also the size of his heart.\n\nAndre was known as the friendly giant, who had a gentle soul and a generous spirit that cannot be matched. That is perhaps why he was so loved by the world. That is perhaps what made him special. He was immensely strong, resilient, and more surprisingly, quick, agile and technical. Andre could not only hit or slam you hard, he would stretch you in multiple ways and surprise you with his shocking explosiveness.\n\nNow, awoken 200 years after his retirement, Andre finds himself in his prime once more, ready to make his mark on the new world. Perhaps this time he will win the championship and keep it for 15 years. Perhaps this time he can prove that stories about him losing to others during his prime are just myths. One thing is for certain: nothing is bigger than Andre the Giant and nothing can stand in his way.",
  "gender": "MALE"
}, {
  "name": "Randy Savage",
  "deckSize": 15,
  "startingHealth": 16,
  "lowHealth": 4,
  "startingStamina": 15,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "“The Macho Man” Randy Savage does not need an introduction. He is one of the most charismatic and popular wrestlers of all time. Known for his raspy voice, flamboyant and colorful outfits, and unmatched intensity, Savage was a showman who captured the world’s imagination like no other.\n\nBut that is not all. He was also one of the greatest wrestlers with a combined 29 championship reigns and 6 world titles to his record. His success was driven by his very aggressive in-ring style that pushed wrestlers to their limit, his never-say-die attitude, and his in-ring intelligence that allowed him to outwit all his opponents.\n\nNow, awoken almost 200 years into the future, The Macho Man sees new possibilities to grow his legacy. With over 20 Billion people watching, this is his chance to remind the entire world of who he is. This is his chance to ensure he is featured prominently on the Mount Rushmore of professional wrestling, forever.\n\nMake no mistake about it; the Macho Man will walk to the ring with his valet, outwork his opponent, dazzle the audience, drop the big elbow, and walk out of this tournament as the Champion of All Time. Step into his ring - “Ohhhh Yeeaaaaaaa!”",
  "gender": "MALE"
}, {
  "name": "Jax Felix",
  "deckSize": 16,
  "startingHealth": 13,
  "lowHealth": 3,
  "startingStamina": 18,
  "lowStamina": 3,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Born in 2122 AD, the self-proclaimed “Miracle See” Jax Felix is a 5th Generation wrestling prodigy from Winnipeg, Canada. He is a former world champion and the founder of “Alpha Pack” Faction, a group that dominated the world of professional wrestling for the better half of a century. He fancies himself as a wrestling miracle and believes he is the very best to have ever lived. He may be right.\n\nGrowing up, Jax was always the ultimate showman, excelling in theatre, musicals and sports. He fed of admiration, had a burning desire to entertain people, and had an insatiable hunger to stand out as the star of the show.\n\nAt the age of 17, he followed in his father’s footsteps, a world champion in his own right, and made his pro-wrestling debut. He immediately proved that he was special, beating veterans with ease and captivating the audience with his innovative and explosive style.\n\nAt the age of 25, he won the world title and reigned champion for a historic 8 years before retiring young and becoming a successful movie star.\n\nJax is a high flyer, a good technician, and a lethal striker. He is explosive, building momentum quickly and finishing his opponents with a blink of an eye. More importantly, he is a showman, always looking to outdo his peers and put on the best match of the night.\n\nThe ultimate showman, Jax is now ready to steal the biggest show the wrestling world has ever seen, win the title, and retire once more. And when he does, the world will not see this as a miracle, but simply a foregone conclusion.",
  "gender": "MALE"
}, {
  "name": "Mukundi Shumba",
  "deckSize": 15,
  "startingHealth": 18,
  "lowHealth": 4,
  "startingStamina": 13,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Legend has it that when “The Lion” known as Mukundi Shumba was born by the Zambezi River in 992 AD, he did not cry. Instead, he let out a roar that made the ground tremble in fear. How could it not?\n\nStanding at 6’6 and 290 pounds of raw power, Shumba is probably the strongest man who has ever lived. He can break his opponents in half and absorb an incredible amount of punishment, a fact that allowed him to best 2321 opponents during his lifetime without ever suffering defeat.\n\nBut what made Shumba stand out above all else was his pride and dedication to his people. His life’s mission was to ensure his tribe remained independent and prosperous, and he was willing to sacrifice anything to achieve this goal. Under his leadership, he formed a kingdom that became a center of prosperity, art and human advancement.\n\nNow, awoken millenniums later, Shumba is horrified to learn about his nation’s demise. His people were conquered and enslaved by colonial powers. To make matters worse, his legend, the man who was never bested, has been forgotten and lost to the annals of history.\n\nShumba now has a new mission. He will roar again, but this time the entire world will break. He will set things right. He will conquer all. He will ensure he and his people are remembered forever. Does anyone dare stand in his way?",
  "gender": "MALE"
}, {
  "name": "The British Bulldog",
  "deckSize": 15,
  "startingHealth": 16,
  "lowHealth": 4,
  "startingStamina": 15,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "“The British Bulldog is gonna win whether he likes it or not”\n\nDavey Boy Smith, “The British Bulldog”, is undoubtedly the most popular and loved British professional wrestler of all time. He was the first-ever European Champion, a former Intercontinental Champion, and a multi-time tag team champion as part of one the greatest tag teams in history, “The British Bulldogs”. He was also a key member of the Hart Foundation.\n\nThe Bulldog was an incredible athlete that mixed power, speed, and intelligence. Pound-for-pound, he was the strongest wrestler of all time, able to lift superheavyweights with ease. In addition to his raw strength, he could move quickly, executing an array of technical and aerial maneuvers that shocked his opponents. On his best day, The Bulldog was an impossible man to beat.\n\nHowever, despite his popularity, some critics have questioned whether the Bulldog can be crowned as the best British Heavyweight of all time. The one blemish on his record was that he was never able to capture a major world title. Now, awoken over 200 years after the untimely end to his career, the Bulldog has one more chance to fulfill his destiny of becoming a world champion. Better yet, he has a chance to become the “Champion of All Time”, the most prestigious title that has ever existed. The time for barking is over… The Bulldog is ready to bite and take his rightful place as the greatest of all time.",
  "gender": "MALE"
}, {
  "name": "Sgt. Slaughter",
  "deckSize": 16,
  "startingHealth": 15,
  "lowHealth": 4,
  "startingStamina": 13,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Sgt. Slaughter is not only a wrestling hall of famer and a former world heavyweight champion, but he is one of the most iconic figures of the 80s and early 90s, not just in the wrestling industry, but the entire world.\n\nHis rise to iconic status began as a villain, known for brutally assaulting his opponents in the ring. The “Cobra Clutch”, his finisher, was, and still is, one of the most feared maneuvers in all of pro wrestling that few wrestlers ever escaped. But Sgt. Slaughter’s real rise came when he defended his country against The Iron Shaikh. Arguably, he was the most popular wrestler in the world at that time, so popular that he was immortalized as a character in the G.I Joe comics and toy lines to this very day.\n\nBut that would not be the only period of his career where he met success. During the Iraq war, Sgt. Slaughter portrayed an Iraqi Sympathizer who loved Saddam Hussain’s brutality. He went from being one of the most loved wrestlers of his generation, to the most hated, winning a World Title in the process.\n\nOff course, Sgt. Slaughter would later redeem himself, establishing himself as a fan favorite and American hero once more before retiring after a legendary career. Now, 200 years into the future, Sgt. Slaughter has awoken to a new world. A world where only the strong can survive. A world where real competition exists. A world that values passion and principles. A world he likes. “Listen up Maggots – it is time to win the All Time Championship. And that is an Orrrrderrr!”",
  "gender": "MALE"
}, {
  "name": "Daemon",
  "deckSize": 15,
  "startingHealth": 13,
  "lowHealth": 1,
  "startingStamina": 13,
  "lowStamina": 3,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Not much is known about this masked “demonic creature” who made his debut in the independent scenes sometime in the 23rd century. He is dubbed as a demonic creature because he may have the biology of a human being, but he certainly does not look or act like one. Chronically disturbed, he has a passion for dealing and receiving pain, for his pain and pain of others makes him feel ALIVE!\n\nHe is usually found in basements and boiler rooms, dwelling in dark thoughts, spreading his ideas among the lost, and more alarmingly, plotting on how to spread anarchy across the promotion and city as a whole. He loves fire and feels elation when things burn down.\n\nHe is not interested in championships or pay. He is not even interested in winning matches. Daemon’s sole purpose is to break his opponents physically and mentally, and by doing so, adding one more disciple to his anarchy movement. What better recruiting grounds than a hardcore tournament? After all, all the world needs is just a touch of madness, and Daemon is here to give it.",
  "gender": "MALE"
}, {
  "name": "Raven",
  "deckSize": 15,
  "startingHealth": 14,
  "lowHealth": 4,
  "startingStamina": 14,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "A former World Champion and a hardcore legend, Raven is a great brawler and a vicious individual. Yet his greatest strength is his combination of unrivalled genius and charisma. Together, this combination made him one of the most dangerous individuals in wrestling.\n\nA master manipulator, he would use psychological warfare to guarantee his victory against his rivals before the match even started!\n\nAdditionally, his charisma and power of persuasion allowed him to create a following in every promotion he has been. This flock of followers that resembles nothing short of a cult, would do anything to protect him, helping him win countless matches.\n\nNow, awoken 200 years into the future, Raven asks “What about me? What about Raven? How was I not included in the initial tournament to crown the All Time Champion?”. To address this perceived insult, Raven has his eyes set on a prize that he wants more than anything. It is his destiny to become the Champion of All Time, and he will fulfill it. Quote the Raven, nevermore.",
  "gender": "MALE"
}, {
  "name": "Brian Pillman",
  "deckSize": 15,
  "startingHealth": 15,
  "lowHealth": 4,
  "startingStamina": 15,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Brian Pillman was born on May 22nd, 1962. An incredible athlete, Brian was an All-American who also played in the NFL as part of the Cincinnati Bengals before transitioning into wrestling and becoming one of the most controversial trail blazers of the 1990s.\n\nBrian began his wrestling career in Stampede wrestling Calgary, learning his craft from the legendary Stu Hart. He then moved to WCW where he was known as Flyin' Brian; an athletic young man who displayed incredible agility and high-flying skills that captured the audience and turned him into a superstar and two-time light heavyweight champion. He would later form an iconic tag team with Steve Austin as part of the Hollywood Blonds, that saw them capture the tag team titles.\n\nBut it was his \"loose cannon\" personality in the mid-1990s that set him apart from other wrestlers. During that time, Brian became increasingly erratic, uncontrollable, unpredictable, and capable of anything. His words and actions shocked fans and wrestlers alike, turning him into one of the hottest wrestlers of the decade, and a member of the 4 horsemen.\n\nBrian’s career would unfortunately be hampered with a serious injury shortly after and a much too early death. Now awoken to a second chance, Pillman is on the loose, looking to upheave, looking for trouble, and no body can even predict what he is going to do next.",
  "gender": "MALE"
}, {
  "name": "Sabu",
  "deckSize": 15,
  "startingHealth": 16,
  "lowHealth": 3,
  "startingStamina": 14,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Homicidal, Suicidal, Genocidal, Death-Defying Maniac. There aren't many men that can live up to this moniker. Sabu not only does, but exceeds expectations. A man of mystery who does not talk much, this icon is undoubtedly one of, if not the greatest hardcore wrestler of all time. He legitimately revolutionized professional wrestling in the 90s with his unique style of innovative and unpredictable aerial attacks mixed with hardcore brutality.\n\nMore importantly, he was legitimately one of the toughest human beings on Earth. As a testament to that toughness, during a barbwire match, Sabu was entangled in barbwire, ripping his bicep off completely, and suffering a ~12-inch gash with his own flesh hanging from his body. Sabu simply responded by taping his arm and continuing the match.\n\nNow, 200 years into the future, Sabu is back in his prime and ready to show the world what hardcore wrestling is about. He will maim his own body to hurt his opponents and prove once and for all that he is the greatest hardcore wrestler of all time.",
  "gender": "MALE"
}, {
  "name": "Dynamite Kid",
  "deckSize": 16,
  "startingHealth": 14,
  "lowHealth": 4,
  "startingStamina": 17,
  "lowStamina": 2,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Across the ages, only a handful of wrestlers can claim to have significantly changed the world of pro-wrestling. Thomas Billington, formerly known as the Dynamite Kid, was one of them.\n\nBorn on December 5th 1958, Thomas did not have the traditional build of a pro-wrestler. Despite his thick muscles, he was relatively short and considered small. Yet what Dynamite lacked in size, he made up for in incredible athleticism, technique, and speed. This new style of high-octane offense blending technical wrestling, high flying, and smash mouth brawling took the world by sensation. Eventually, many of the world's greatest wrestlers were inspired by it, adopting his style into their own work.\n\nDespite never winning a major single's world title, his incredible matches with the likes of Tiger Mask, and his tag team partnership with The British Bulldog have solidified his legacy as one of the best in-ring performers in history. Now, he awaits his chance to revolutionize the art of pro-wrestling once more, this time, in front of the world's largest wrestling audience. Can anyone keep up with Dynamite?",
  "gender": "MALE"
}, {
  "name": "Gilgamesh",
  "deckSize": 15,
  "startingHealth": 16,
  "lowHealth": 4,
  "startingStamina": 14,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Of all the kings that ruled Mesopotamia, the world’s oldest civilization, no King can compare to Gilgamesh. Born in the great city of Uruk in roughly 2500 BC, Gilgamesh was gifted with unnatural strength, size, and speed, making him peerless among his contemporaries. He tested himself among the ancient world’s best fighters in the earliest recorded wrestling matches in human history, slaying and defeating all that stood before him.\n\nThese physical attributes and immense power ensured he ruled Uruk unopposed. Yet this power also corrupted Gilgamesh early on, turning him into the world’s most vilified tyrant. He ruled with a ruthless iron fist, paid no heed to justice, and imposed his malicious will on all his subjects.\n\nBut then, as legend would have it, Gilgamesh was finally challenged by “Enkidu”, a man of animalistic power. During their wrestling match, Enkidu stood toe-to-toe with Gilgamesh, not yielding an inch. And though Gilgamesh would eventually suplex Enkidu to win the battle, Enkidu earned his respect, so much so that this friendship would blossom and inspire Gilgamesh to seek redemption.\n\nThe King would abandon his tyrannical ways, supporting the needy, and using his strength to fight injustice. This redemption story would cement his legacy as a great king and ensure his story passed on through the ages, eventually codified in a series of poems that are the oldest recorded literature in history.\n\nNow, awoken more than 3,500 years in the future, Gilgamesh, The Redeemed King, is pleasantly surprised to find that though he had died a long time ago, he was immortalized through the legacy he built. What better way to solidify his status and grow that legacy than beating all pretenders to his throne and crowning himself the Champion of All Time? Perhaps it is time for a new Epic; “the second coming of Gilgamesh”, Ruler of Uruk, Ruler of All Time.",
  "gender": "MALE"
}, {
  "name": "Nick Aldis",
  "deckSize": 15,
  "startingHealth": 16,
  "lowHealth": 3,
  "startingStamina": 14,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "The National Treasure, Nick Aldis, is a four-time world champion, and one of the longest reigning champions of the 21st century, holding the NWA World Title for more than 1000+ days with 34 successful title defenses under his belt.\n\nHe is considered by many as the total package; tall, strong, agile, charismatic, well dressed and well spoken, and a heck of a wrestler. More importantly, he is seen as a thinking man who can outsmart his opponent with superior strategy and tactics to win any match. A fact that had earned him the moniker of being a Ring General.\n\nNow, Aldis has awoken to a new world. He not only plans to win the All-Time Championship, which he considers a foregone conclusion, but to hold it for so long that he would break any living record of any other world title. How would he do so you may ask? He won't simply rely on his strength, skill and speed, but on the one thing no other wrestler can compete with him on; his brilliant mind.",
  "gender": "MALE"
}, {
  "name": "Junkyard Dog",
  "deckSize": 15,
  "startingHealth": 15,
  "lowHealth": 4,
  "startingStamina": 15,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "The Junkyard Dog (JYD) was one of the most electrifying and charismatic wrestlers of the 1980s. His unique persona, dancing skills and incredible promos made him undoubtedly the top star in his promotion. At times, one may argue he was the most popular wrestler in the world. A fact that led to his induction into the hall of fame in 2004.\n\nBut the adoration of his fans, adults and children alike, were not the only things that made JYD special. He was a great athlete and wrestler too. He was also a two-time All-American football player in college. In the ring, JYD was most known for his headbutts. He constantly rocked his opponents to their body and heads. One would lose count of the amount of headbutts he would land in one match! Whether they were standing, resting, or crawling, no one was safe.\n\nEqually important to his headbutts, JYD had incredible strength that allowed him to spar with the largest of heavyweights and slam his opponents into oblivion with a massive “thump”.\n\nNow, JYD has an opportunity to electrify the masses and headbutt his way to winning the first All Time Wrestling Rumble. He will bark, he will batter, and he will thump his way to victory.",
  "gender": "MALE"
}, {
  "name": "Eddie Guerrero",
  "deckSize": 16,
  "startingHealth": 15,
  "lowHealth": 4,
  "startingStamina": 16,
  "lowStamina": 3,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Eddie Guerrero is one of the most beloved wrestlers in history. His name is synonymous with passion, charisma, and great wrestling, a fact that made him a world champion and one of the biggest superstars of his generation. But his legacy went beyond titles; he was a pioneer, an innovator, and a trailblazer who left an indelible mark on professional wrestling.\n\nHailing from the legendary Guerrero family, Eddie was always destined for greatness. Throughout his 20-year career, he worked hard to overcome stereotypes and carve out an incredible legacy that spanned the world. In the ring, Eddie was highly versatile. He could fly like a luchador or match the technical abilities of the very best technicians of his age. But what made him a fan favorite was his talent to outthink his opponent, bend a few rules, and win at all costs in the most entertaining and endearing fashion. No body could cheat or lie like Guerrero, who won his matches in the most ingenious and illegal ways.\n\nNow, resurrected 200+ years into the future and with the crowd firmly behind him, Eddie plans to lie, cheat, scheme and steal his way to winning the All-Time Championships and cementing himself as the greatest Mexican wrestler of all time.",
  "gender": "MALE"
}, {
  "name": "Matt Cardona",
  "deckSize": 15,
  "startingHealth": 15,
  "lowHealth": 4,
  "startingStamina": 14,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Matt Cardona\nMany wrestlers have laid claim to the moniker of the greatest of all time, but only one wrestler can crown himself as the undisputed king of the indies.\n\nAfter capturing multiple single and tag team championships in the world's largest wrestling promotion, Matt Cardona left in 2020, reinventing himself and instantly conquering the indie scene. He wrestled in almost every indie promotion, winning titles wherever he went, including several hardcore championships that solidified his reputation as \"The Deathmatch King\". It is difficult to keep track of the number of championships he has won since then. At any given moment, the belt collector held no less than 8 titles at the same time.\n\nNow, having conquered the indies, Matt Cardona has set his eyes on the most prized possession. One belt he hasn't captured yet. One title to rule them all. Can Matt Cardona become the All Time Wrestling Champion?",
  "gender": "MALE"
}, {
  "name": "OMZ",
  "deckSize": 15,
  "startingHealth": 14,
  "lowHealth": 4,
  "startingStamina": 16,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "OMZ \"The Knockout Artist\"\nBorn on July 7th, 2005, OMZ could only be described as a prodigy. Growing up, he excelled at mathematics and music, and mastered the art of combat, winning multiple championships in grappling and striking combat sports. He was also fascinated with technology. He loved spending his time competing in E-sports competitions and testing his hacking skills online.\n\nBut his encounters with technology would soon get him into serious trouble. After hacking a Russian company website, he soon discovered a massive conspiracy to cover-up illicit activities that significantly harm the environment and its inhabitants. Before he could alert the authorities, he was kidnapped and jailed in a Siberian prison. It is there that \"OMZ\", the \"Knock-out Artist\", was born.\n\nForged in this dangerous and inhospitable environment, OMZ’s skillsets were sharpened to help him reach his full fighting potential. After knocking-out or submitting a few rowdy inmates, he was invited to take part in the covert tournament named \"Deadly Combat\" that brought together the world’s most notorious criminals and fighters. He won the tournament, and proceeded to do so for 5 consecutive years, winning his freedom in the process.\n\nNow, battle hardened and unleashed on the world of pro-wrestling and MMA, this dual-combat sport athlete is ready to test the mettle of all those who are unfortunate enough to stand in his way. Make no mistake about it, he will make you scream before knocking you out and painting the ring mat with your blood. For what is art without violence?",
  "gender": "MALE"
}, {
  "name": "Kamala",
  "deckSize": 16,
  "startingHealth": 17,
  "lowHealth": 4,
  "startingStamina": 12,
  "lowStamina": 4,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "Not much is known about the Ugandan Giant, Kamala. Nothing more than a few hints, collected over 2 decades covering his path of destruction.\n\nRumored to be a bodyguard of General Idi Amin, Kamala was a large man, standing at 6’7 and weighing more than 350 pounds. Clothed with nothing more than lionskin, a spear and a mask, and armed with a reputation of utter savagery, he struck fear into the hearts of his opponents. No wrestler dared to challenge Kamala. Those who did lived to regret it. Others luckily escaped him.\n\nNow, awoken centuries later, Kamala seeks to brutalize his opponents, knocking dozens out with his devastating chops, and winning the greatest rumble of all time. Nothing will deny him. No one will escape him. It is that simple.\n\nWould you like me to compile these into a formatted table comparing their heights, weights, and eras of origin?",
  "gender": "MALE"
}, {
  "name": "Johnny All Time",
  "deckSize": 16,
  "startingHealth": 14,
  "lowHealth": 4,
  "startingStamina": 17,
  "lowStamina": 2,
  "fans": 0,
  "isPlayer": false,
  "bumps": 0,
  "description": "John Hennigan, fka John Morrison, has more names than one can count. So are the number of titles he held, including single and tag team world titles in almost every major promotion across the world.\n\nHis popularity was magnified by his incredible look and oozing charisma, a fact that turned him into a movie star. But what makes John Hennigan stand out above all else is his incredible athleticism and flair. Using his parkour background and creative mind, Johnny’s career can be viewed as a set of highlight reels, each one more astonishing than the next.\n\nNow, the Mayor of Slamtown is ready to create a new highlight reel of awesomeness. More importantly, he is looking to add one more name and one more title to his belt. Here is Johnny All Time.",
  "gender": "MALE"
} ]